const dem = require('../src/dem');

describe('демукрон', () => {
    it('работает на несвязанном графе', () => {
        const graph = [
            [],
            [],
            [],
        ];

        expect(dem(graph)).toEqual([[0, 1, 2]]);
    });

    it('работает для примера алгоритма Тарьяна', () => {
        const graph = [
            [3],
            [],
            [1],
            [1, 2],
        ];

        expect(dem(graph)).toEqual([[0], [3], [2], [1]]);
    });

    it('работает для примера из лекции', () => {
        const graph = [
            [2, 12],
            [12],
            [],
            [2],
            [2, 8, 9],
            [3, 10, 11],
            [10],
            [1, 3, 5, 6],
            [0, 13],
            [0, 6, 11],
            [2],
            [],
            [2],
            [5],
        ];

        expect(dem(graph)).toEqual([[4, 7], [1, 8, 9], [0, 6, 13], [5, 12], [3, 10, 11], [2]]);
    });
});
